# PointLightShape Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointLightShape Class
Members See Also
---
This class encapsulates a point light shape.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class PointLightShape : LightShape
```

Visual Basic
---
```text
Public Class PointLightShape _
	Inherits LightShape
```

Visual C++
---
```text
public ref class PointLightShape : public LightShape
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Lighting..::..LightShape Autodesk.Revit.DB.Lighting..::..PointLightShape
# See Also
PointLightShape Members
Autodesk.Revit.DB.Lighting Namespace